# 직접 해보세요!
## groupby 메서드로 평균값 구하기(215쪽)


그룹연산

In [1]:
import pandas as pd 
df = pd.read_csv('../data/gapminder.tsv', sep='\t')

In [2]:
avg_life_exp_by_year = df.groupby('year').lifeExp.mean() 
print(avg_life_exp_by_year)

# avg_life_exp_by_year = df.groupby('year')['lifeExp'].mean()
# print(avg_life_exp_by_year)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [3]:
df.year.unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

df.groupby('year').lifeExp.mean()<br>
df.lifeExp.groupby(df.year).mean() 둘다 같음. 

lifeExp 열만 뽑아서(시리즈가됨) df.year의 평균값으로 그룹바이함.

# 직접 해보세요!
## 분할-반영-결합 과정 살펴보기(216쪽)

In [4]:
years = df.year.unique() 
print(years)

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [5]:
y1952 = df.loc[df.year == 1952, :] 
print(y1952.head())

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
12      Albania    Europe  1952   55.230   1282697  1601.056136
24      Algeria    Africa  1952   43.077   9279525  2449.008185
36       Angola    Africa  1952   30.015   4232095  3520.610273
48    Argentina  Americas  1952   62.485  17876956  5911.315053

In [6]:
y1952_mean = y1952.lifeExp.mean() 
print(y1952_mean)

49.05761971830987

In [7]:
y1957 = df.loc[df.year == 1957, :] 
y1957_mean = y1957.lifeExp.mean( )
print(y1957_mean)

y1962 = df.loc[df.year == 1962, :] 
y1962_mean = y1962.lifeExp.mean( )
print(y1962_mean)

y2007 = df.loc[df.year == 2007, :] 
y2007_mean = y2007.lifeExp.mean( )
print(y2007_mean)

51.50740112676054
53.60924901408449
67.00742253521126

In [8]:
df2 = pd.DataFrame({"year":[1952, 1957, 1962, 2007], 
                    "":[y1952_mean, y1957_mean,y1962_mean,y2007_mean]}) 
print(df2)

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [6]:
#한번에 표현하기. 분할, 반영, 결합. 


aggdict ={}
for year, group in df.groupby('year'):
    aggdict[year] = group.lifeExp.mean()
           
pd.Series(aggdict)

1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
dtype: float64

In [9]:
pd.Series(aggdict).reset_index()

    index          0
0    1952  49.057620
1    1957  51.507401
2    1962  53.609249
3    1967  55.678290
4    1972  57.647386
5    1977  59.570157
6    1982  61.533197
7    1987  63.212613
8    1992  64.160338
9    1997  65.014676
10   2002  65.694923
11   2007  67.007423

# 직접 해보세요!
## 평균값을 구하는 사용자 함수와 groupby 메서드(219쪽)

In [11]:
def my_mean(values):
    n = len(values)
    
    sum = 0 
    for value in values:
        sum += value
    
    return sum / n

In [12]:
agg_my_mean = df.groupby('year').lifeExp.agg(my_mean) 
print(agg_my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

agg 메소드의 인자로 함수를 사용하는데., 이 함수는 vector 즉, 1d Array에 대해

평균편차를 제공하는 함수를 작성하여, lifeExp에 대해  년도별로 집계하세요.

In [36]:
def md(df):
    sum = 0
    N = len(df.lifeExp)
    for i in df.lifeExp:
        sum = sum + abs(i-mean)
    
    return sum/N

In [46]:


df.groupby(['year']).apply(md).mean()

11.307998834804602

In [39]:
import numpy as np
meanDev = lambda vec : np.abs(vec - vec.mean()).mean()

In [45]:
df.groupby('year').lifeExp.agg(meanDev).mean()

10.111350938967137

In [23]:
mean=df.lifeExp.mean()

In [19]:
df.lifeExp[0]

28.801

In [32]:
sum = 0
N = len(df.lifeExp)
for i in df.lifeExp:
    sum = sum + abs(i-mean)
    
print(sum/N)

11.307998834804597

In [30]:
len(df.lifeExp)

1704

In [20]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

# 직접 해보세요!
## 두 개의 인잣값을 받아 처리하는 사용자 함수와 groupby 메서드(220쪽)

In [10]:
def my_mean_diff(values, diff_value):
    n = len(values) 
    sum = 0 
    for value in values:
        sum += value 
    mean = sum / n 
    return mean - diff_value

In [11]:
global_mean = df.lifeExp.mean() 
print(global_mean)

59.47443936619713

In [12]:
agg_mean_diff = df.groupby('year').lifeExp.agg(my_mean_diff, diff_value=global_mean) 
print(agg_mean_diff)

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

# 직접 해보세요!
## 집계 메서드를 리스트, 딕셔너리에 담아 전달하기(221쪽)

In [52]:
import numpy as np
gdf = df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std]) 
print(gdf)

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [17]:
gdf_dict = df.groupby('year').agg({'lifeExp': 'mean', 'pop': 'median', 'gdpPercap': 'median'}) 
print(gdf_dict)

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334741
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371109

In [53]:
gdf.columns = ['cntExpLife','meanExpLife','stdExpLife']
gdf

      cntExpLife  meanExpLife  stdExpLife
year
1952       142.0    49.057620   12.225956
1957       142.0    51.507401   12.231286
1962       142.0    53.609249   12.097245
1967       142.0    55.678290   11.718858
1972       142.0    57.647386   11.381953
1977       142.0    59.570157   11.227229
1982       142.0    61.533197   10.770618
1987       142.0    63.212613   10.556285
1992       142.0    64.160338   11.227380
1997       142.0    65.014676   11.559439
2002       142.0    65.694923   12.279823
2007       142.0    67.007423   12.073021

In [54]:
mulAggFts = [('cntExpLife'. np.count_nonzero),
            ]

AttributeError: 'str' object has no attribute 'np'

변수마다 서로 다른 집계함수를 사용할 때는 아래와 같이 사전을 이용한다. 딕셔너리 형태로 사용하기

In [57]:
df.groupby('year').agg({'lifeExp': np.mean, 'pop':'median'})

        lifeExp         pop
year
1952  49.057620   3943953.0
1957  51.507401   4282942.0
1962  53.609249   4686039.5
1967  55.678290   5170175.5
1972  57.647386   5877996.5
1977  59.570157   6404036.5
1982  61.533197   7007320.0
1987  63.212613   7774861.5
1992  64.160338   8688686.5
1997  65.014676   9735063.5
2002  65.694923  10372918.5
2007  67.007423  10517531.0

In [ ]:
lifeExp 변수에는 평균과 표준편차를, pop에는 중간값과 IQR을, gdpPercap 은 평균과 중간값을 계산하기 대칭적 인덱스를 가진 열이 생김.

In [123]:
from scipy.stats import iqr

In [121]:

def iqr(x):

    q3, q1 = np.percentile(x, [75, 25])

    iqr = q3 - q1

    return iqr

In [122]:
df.groupby('year').agg({'lifeExp': [np.mean, np.std], 'pop':['median',iqr], 'gdpPercap' :['mean','median']})

        lifeExp                    pop                  gdpPercap
           mean        std      median          iqr          mean       median
year
1952  49.057620  12.225956   3943953.0   7716171.50   3725.276046  1968.528344
1957  51.507401  12.231286   4282942.0   8248786.75   4299.408345  2173.220291
1962  53.609249  12.097245   4686039.5   9195722.50   4725.812342  2335.439533
1967  55.678290  11.718858   5170175.5  10579816.25   5483.653047  2678.334741
1972  57.647386  11.381953   5877996.5  12328008.00   6770.082815  3339.129407
1977  59.570157  11.227229   6404036.5  13910509.75   7313.166421  3798.609244
1982  61.533197  10.770618   7007320.0  15401038.50   7518.901673  4216.228428
1987  63.212613  10.556285   7774861.5  17752553.00   7900.920218  4280.300366
1992  64.160338  11.227380   8688686.5  19099390.50   8158.608521  4386.085502
1997  65.014676  11.559439   9735063.5  20541220.00   9090.175363  4781.825478
2002  65.694923  12.279823  10372918.5  22372050.25   9917.848365  5319.804524
2007  67.007423  12.073021  10517531.0  26702008.25  11680.071820  6124.371109

In [72]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

# 직접 해보세요!
## 표준점수 계산하기(223쪽)

In [129]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [124]:
def my_zscore(x):
    return (x - x.mean()) / x.std()

In [125]:
transform_z = df.groupby('year').lifeExp.transform(my_zscore)

print(transform_z.head())

0   -1.656854
1   -1.731249
2   -1.786543
3   -1.848157
4   -1.894173
Name: lifeExp, dtype: float64

In [180]:
df['myzscore_year_exp']=df.groupby(['year']).lifeExp.transform(my_zscore)

b=df.drop('myzscore_year',axis=1)

b.drop(['continent','pop','gdpPercap'],axis=1,inplace=True)
b

          country  year  lifeExp  myzscore_year_exp
0     Afghanistan  1952   28.801          -1.656854
1     Afghanistan  1957   30.332          -1.731249
2     Afghanistan  1962   31.997          -1.786543
3     Afghanistan  1967   34.020          -1.848157
4     Afghanistan  1972   36.088          -1.894173
...           ...   ...      ...                ...
1699     Zimbabwe  1987   62.351          -0.081621
1700     Zimbabwe  1992   60.377          -0.336974
1701     Zimbabwe  1997   46.809          -1.574962
1702     Zimbabwe  2002   39.989          -2.093346
1703     Zimbabwe  2007   43.487          -1.948180

[1704 rows x 4 columns]

In [164]:

a = df.groupby(['year']).transform(my_zscore)

a

       lifeExp       pop  gdpPercap  myzscore_year
0    -1.656854 -0.146729  -0.316040      -1.656854
1    -1.731249 -0.145372  -0.352449      -1.731249
2    -1.786543 -0.145495  -0.446815      -1.786543
3    -1.848157 -0.141885  -0.574092      -1.848157
4    -1.894173 -0.136615  -0.568107      -1.894173
...        ...       ...        ...            ...
1699 -0.081621 -0.207589  -0.868065      -0.081621
1700 -0.336974 -0.203101  -0.826541      -0.336974
1701 -1.574962 -0.205629  -0.815782      -1.574962
1702 -2.093346 -0.209665  -0.828915      -2.093346
1703 -1.948180 -0.214807  -0.871728      -1.948180

[1704 rows x 4 columns]

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [126]:
print(df.shape)

(1704, 6)

In [127]:
print(transform_z.shape)

(1704,)

In [128]:
transform_z

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

# 직접 해보세요!
## 누락값을 평균값으로 처리하기(224쪽)

In [181]:
import seaborn as sns 
import numpy as np

np.random.seed(42)
tips_10 = sns.load_dataset('tips').sample(10)
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = np.NaN

print(tips_10)

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [182]:
count_sex = tips_10.groupby('sex').count() 
print(count_sex)

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [183]:
def fill_na_mean(x):
    avg = x.mean() 
    return x.fillna(avg)

In [184]:
total_bill_group_mean = tips_10.groupby('sex').total_bill.transform(fill_na_mean)
tips_10['fill_total_bill'] = total_bill_group_mean
print(tips_10)

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2          19.8200
6          8.77  2.00    Male     No   Sun  Dinner     2           8.7700
153         NaN  2.00    Male     No   Sun  Dinner     4          17.9525
211         NaN  5.16    Male    Yes   Sat  Dinner     4          17.9525
198         NaN  2.00  Female    Yes  Thur   Lunch     2          13.9300
176         NaN  2.00    Male    Yes   Sun  Dinner     2          17.9525
192       28.44  2.56    Male    Yes  Thur   Lunch     2          28.4400
124       12.48  2.52  Female     No  Thur   Lunch     2          12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2          14.7800
101       15.38  3.00  Female    Yes   Fri  Dinner     2          15.3800

전체 tips 데이터에서 일부의 total_bill 에 대한 결측치를 대체하는 더 좋은 대안은?

In [191]:
tips = sns.load_dataset("tips") 
# print(tips.head())
# print(type(tips))

tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# 직접 해보세요!
## 데이터 필터링 사용하기 ─ filter 메서드(227쪽)

In [23]:
tips = sns.load_dataset('tips')

print(tips.shape)

(244, 7)

In [24]:
print(tips['size'].value_counts())

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [25]:
tips_filtered = tips.\
    groupby('size').\
    filter(lambda x: x['size'].count() >= 30)

In [26]:
print(tips_filtered.shape)

(231, 7)

In [27]:
print(tips_filtered['size'].value_counts())

2    156
3     38
4     37
Name: size, dtype: int64

q1 과 q3 구하고 ?

전체 데이터 total_bill과 tip의 평균과 중간값 구하고, 
tip/total_bill 이상치 식별한 후, 
이상치를 제거할 때의 total_bill과 tip 의 평균과 중간값을 비교

In [246]:
tipsbillmean=tips['total_bill'].mean()
tipsbillmedian= tips['total_bill'].median()

tipstipmean = tips['tip'].mean()
tipstipmedian = tips['tip'].median()

tipstipmedian

2.9

In [199]:
tips['tipRate'] = tips['tip']/tips['total_bill']

tips

     total_bill   tip     sex smoker   day    time  size   tipRate
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

<li>
    이상치 하한 : Q1 -1.5*iqr
 <li>   이상치 상한 ; q3 + 1.5*iqr

In [211]:
q1 = tips['tipRate'].quantile(.25)
q3 = tips['tipRate'].quantile(.75)


iqr = q3-q1

q1out = q1-(1.5*iqr)
q3out = q3+(1.5*iqr)

print(q1out,q3out)

0.03560517486275866 0.2849976732103248

In [242]:
tips2 = tips[(tips['tipRate']<q3out) & (tips['tipRate']>q1out)]

tips2billmean=tips2['total_bill'].mean()
tips2billmedian=tips2['total_bill'].median()
tips2tipmean=tips2['tip'].mean()
tips2tipmedian=tips2['tip'].median()

In [255]:
tipstips2 = pd.DataFrame({ 
    ' ': ['mean', 'median'], 
    '원본': [tipsbillmean, tipsbillmedian], 
    '이상치제거': [tips2billmean, tips2billmedian],
    '차이값' : [tipsbillmean - tips2billmean, tipsbillmedian-tips2billmedian]}) 
print(tipstips2)

                  원본      이상치제거       차이값
0    mean  19.785943  19.984333 -0.198391
1  median  17.795000  17.855000 -0.060000

In [254]:
tipstips2 = pd.DataFrame({ 
    ' ': ['mean', 'median'], 
    '원본': [tipstipmean, tipstipmedian], 
    '이상치제거': [tips2tipmean, tips2tipmedian],
    '차이값' : [tipstipmean - tips2tipmean, tipstipmedian-tips2tipmedian]})
print(tipstips2)

                 원본     이상치제거       차이값
0    mean  2.998279  2.991833  0.006445
1  median  2.900000  2.855000  0.045000

# 직접 해보세요!
## 그룹 오브젝트 저장하여 살펴보기(229쪽)

In [28]:
tips_10 = sns.load_dataset('tips').sample(10, random_state=42) 
print(tips_10)

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [29]:
grouped = tips_10.groupby('sex')
print(grouped)

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x00000209D96377F0>

In [30]:
print(grouped.groups)

{'Male': Int64Index([24, 6, 153, 211, 176, 192, 9], dtype='int64'), 'Female': Int64Index([198, 124, 101], dtype='int64')}

# 직접 해보세요!
## 그룹 오브젝트의 평균 구하기(230쪽)

In [31]:
avgs = grouped.mean() 
print(avgs)

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [32]:
print(tips_10.columns)

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

# 직접 해보세요!
## 그룹 오브젝트에서 데이터 추출하고 반복하기(231쪽)

In [33]:
# 그룹 오브젝트 활용 참고
# https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html

In [34]:
female = grouped.get_group('Female') 
print(female)

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [35]:
for sex_group in grouped:
    print(sex_group)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [36]:
for sex_group in grouped:
    print('the type is: {}\n'.format(type(sex_group)))
    print('the length is: {}\n'.format(len(sex_group)))

    first_element = sex_group[0] 
    print('the first element is: {}\n'.format(first_element))
    print('it has a type of: {}\n'.format(type(sex_group[0])))

    second_element = sex_group[1] 
    print('the second element is:\n{}\n'.format(second_element))
    print('it has a type of: {}\n'.format(type(second_element)))

    print('what we have:') 
    print(sex_group)

    break

the type is: <class 'tuple'>

the length is: 2

the first element is: Male

it has a type of: <class 'str'>

the second element is:
     total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2

it has a type of: <class 'pandas.core.frame.DataFrame'>

what we have:
('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)

# 직접 해보세요!
## 그룹 오브젝트 계산하고 살펴보기(234쪽)

In [40]:
bill_sex_time = tips_10.groupby(['sex', 'time'])
group_avg = bill_sex_time.mean() 

print(group_avg)

               total_bill       tip      size
sex    time
Male   Lunch    28.440000  2.560000  2.000000
       Dinner   18.616667  2.928333  2.666667
Female Lunch    12.740000  2.260000  2.000000
       Dinner   15.380000  3.000000  2.000000

In [39]:
print(type(group_avg))

<class 'pandas.core.frame.DataFrame'>

In [40]:
print(group_avg.columns)

Index(['total_bill', 'tip', 'size'], dtype='object')

In [41]:
print(group_avg.index)

MultiIndex(levels=[['Male', 'Female'], ['Lunch', 'Dinner']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['sex', 'time'])

In [ ]:
group_method = tips_10.groupby(['sex', 'time']).mean().reset_index() 
print(group_method)

In [ ]:
group_param = tips_10.groupby(['sex', 'time'], as_index=False).mean( ) 
print(group_param)